flutter_login/app/Http/Controllers/webcontroller/UserReportsController.php

    public function usershow(){
        $users=User::all();
        $users = DB::table('users')->paginate(10);
---
select count(*) as aggregate from `users`
select * from `users`